create-patch/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          160;
        startFace       1600;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          160;
        startFace       1760;
    }
    inner-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       1920;
    }
    outer-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       2080;
    }
)

// ************************************************************************* //
